frontend/controllers/CategoryController.php

public function actionView($id) {
        $produk = new Product();
        $kategori = Category::find()->where(['category_id' => $id])->one();
---
SELECT * FROM `category` WHERE `category_id`='1'