frontend/controllers/ProductController.php

SELECT * FROM `product` WHERE `product_id`='1'
---
    protected function findModel($id)
    {
        if (($model = Product::findOne($id)) !== null) {