frontend/controllers/ProductRatingController.php

    protected function findModel($id)
    {
        if (($model = ProductRating::findOne($id)) !== null) {
---
SELECT * FROM `product_rating` WHERE `id`='21'