frontend/controllers/UserController.php

    public function actionViewProfile() {
        $id = Yii::$app->user->id;
        $member = User::findOne(['id' => $id]);
---
SELECT * FROM `user` WHERE `id`=1